tap "goreleaser/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "teamookla/speedtest"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run a Kubernetes cluster locally
brew "minikube"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Manage multiple Node.js versions
brew "nvm"
# Highly capable, feature-rich programming language
brew "perl"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser/tap/goreleaser"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Scriptable scratchpad for developers
cask "boop"
# Design tool
cask "canva"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Voice and text chat software
cask "discord"
# Network scanner
cask "fing"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Kubernetes IDE
cask "lens"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Collaboration platform for API development
cask "postman"
# Screen recorder and editor
cask "screen-studio"
# Native GUI tool for relational databases
cask "tableplus"
# Open-source code editor
cask "visual-studio-code"
# Remote desktop application focusing on security
cask "vnc-viewer"
vscode "bierner.markdown-preview-github-styles"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gitpod.gitpod-desktop"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "postman.postman-for-vscode"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "unifiedjs.vscode-mdx"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"
